= Compute embeddings similarity
include::{ga-courses-uri}/llm-vectors-unstructured/ad.adoc[]

Once embeddings are in the database, you can compute the similarity of two of them using the Cypher function link:https://neo4j.com/docs/cypher-manual/current/functions/vector/#functions-similarity-cosine[`vector.similarity.cosine()`].

.Compare embeddings for two related movies
====
.Query
[source, cypher, test-result-skip]
----
MATCH (a:Movie {title: "Despicable Me"})
MATCH (b:Movie {title: "Despicable Me 2"})
RETURN vector.similarity.cosine(a.embedding, b.embedding)
----

.Result with SentenceTransformer embeddings
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| vector.similarity.cosine(a.embedding, b.embedding)
| 0.7020013332366943
|===
====

.Compare embeddings for two unrelated movies
====
[source, cypher, test-result-skip]
.Query
----
MATCH (a:Movie {title: "Despicable Me"})
MATCH (b:Movie {title: "Emperor's New Groove, The"})
RETURN vector.similarity.cosine(a.embedding, b.embedding)
----

.Result with SentenceTransformer embeddings
[role="queryresult",options="header,footer",cols="1*<m"]
|===
| vector.similarity.cosine(a.embedding, b.embedding)
| 0.6120055317878723
|===
====

[TIP]
The similarity value of two nodes is not very relevant for practical purposes.
You are normally interested in retrieving the most relevant node(s) given some criteria, so what matters most is that the desired node scores highest _relative to_ the others.
For example, it doesn't matter what similarity score `Despicable Me` and `Despicable Me 2` have; what matters is that it is the highest among all the movies nodes.

This method works fine for comparing two movies, but it doesn't work to find the most similar nodes to `Despicable Me`.
To be able to quickly retrieve nodes basing on their embeddings, go on to xref:setup/vector-index.adoc[create a vector index] on the movie embeddings and xref:query/search-prompt.adoc[query the database] based on that.
